StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/command-console/source/wifi_utility/COMPONENT_WCM/wifi_utility.c
/*
 * Copyright 2024, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/** @file wifi_utility.c
 *  @brief This file contains the definition of Wi-Fi commands and implementation of the
 *  command handlers.
 */
#include "cy_secure_sockets.h"
#include "cyabs_rtos.h"
#include "whd_chip.h"
#include "whd_types_int.h"
#include "whd_wlioctl.h"
#ifndef DISABLE_COMMAND_CONSOLE_WIFI
#include "command_console.h"
#include "wifi_utility.h"

#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#include "cy_wcm.h"

#ifdef __cplusplus
extern "C" {
#endif

#ifdef COMPONENT_CAT5
#define ENABLE_ENTPS_FEATURE
#endif /* COMPONENT_CAT5 */

/******************************************************
 *                      Macros
 ******************************************************/
#define INITIALISER_IPV4_ADDRESS1(addr_var, addr_val) addr_var = {CY_WCM_IP_VER_V4, {.v4 = (uint32_t)(addr_val)}}
#define MAKE_IPV4_ADDRESS1(a, b, c, d)      ((((uint32_t) d) << 24) | (((uint32_t) c) << 16) | (((uint32_t) b) << 8) |((uint32_t) a))

#define CMD_CONSOLE_SSID_MAX_LENGTH         33 /* 32 is what 802.11 defines as longest possible name; +1 for the \0 */
#define CMD_CONSOLE_PASS_MAX_LENGTH         64

#ifndef CMD_CONSOLE_MAX_WIFI_RETRY_COUNT
#define CMD_CONSOLE_MAX_WIFI_RETRY_COUNT    5
#endif

#define CMD_CONSOLE_PING_TIMEOUT_DEFAULT    10000
#define CMD_CONSOLE_IPV4_ADDR_SIZE          4

#if defined(__ICCARM__)
#define WIFI_WEAK_FUNC            __WEAK
#elif defined(__GNUC__) || defined(__clang__) || defined(__CC_ARM)
#define WIFI_WEAK_FUNC            __attribute__((weak))
#else
#define WIFI_WEAK_FUNC           __attribute__((weak))
#endif

int global_iface = CY_SOCKET_STA_INTERFACE;

extern whd_interface_t whd_ifs[2];

whd_interface_t whd_if;

/******************************************************
 *               External Function Declarations
 ******************************************************/
extern char *strtok_r( char *, const char *, char ** );

// Forward declaration for iperf function
extern int iperf(int argc, char *argv[], tlv_buffer_t** data);

/******************************************************
 *               Function Declarations
 ******************************************************/

/* Wi-Fi commands */
int join               (int argc, char* argv[], tlv_buffer_t** data);
int leave              (int argc, char* argv[], tlv_buffer_t** data);
int scan               (int argc, char* argv[], tlv_buffer_t** data);
int ping               (int argc, char* argv[], tlv_buffer_t** data);
int get_rssi           (int argc, char* argv[], tlv_buffer_t** data);
int start_ap           (int argc, char* argv[], tlv_buffer_t** data);
int stop_ap            (int argc, char* argv[], tlv_buffer_t** data);
int get_sta_ifconfig   (int argc, char* argv[], tlv_buffer_t** data);
int start_def_ap       (int argc, char* argv[], tlv_buffer_t** data);
int start_def_ap2      (int argc, char* argv[], tlv_buffer_t** data);
int start_def_ap5      (int argc, char* argv[], tlv_buffer_t** data);
int start_def_sta      (int argc, char* argv[], tlv_buffer_t** data);
int start_def_sta2     (int argc, char* argv[], tlv_buffer_t** data);
int iperf_client_def   (int argc, char* argv[], tlv_buffer_t** data);
int iperf_server_def   (int argc, char* argv[], tlv_buffer_t** data);
int disable_iovar_pre  (int argc, char* argv[], tlv_buffer_t** data);
int disable_iovar_post (int argc, char* argv[], tlv_buffer_t** data);

#define WIFI_COMMANDS_LIMITED_SET \
    { (char*) "join",               join,             2, NULL, NULL, (char*) "<ssid> <open|wpa_aes|wpa_tkip|wpa2|wpa2_aes|wpa2_aes_sha256|wpa2_tkip|wpa2_fbt|wpa3|wpa3_wpa2> [password] [channel] [band<0=auto,1=5G,2=2.4G,3=6G>]"ESCAPE_SPACE_PROMPT, (char*) "Join an AP.(This command is deprecated and it will be removed in the future. Please use wifi_join command)"}, \
    { (char*) "leave",              leave,            0, NULL, NULL, (char*) "", (char*) "Leave the connected AP.(This command is deprecated and it will be removed in the future. Please use wifi_leave command)"}, \
    { (char*) "scan",               scan,             0, NULL, NULL, (char*) "", (char*) "Scan all the Wi-Fi AP in the vicinity.(This command is deprecated and it will be removed in the future. Please use wifi_scan command)"}, \
    { (char*) "ping",               ping,             0, NULL, NULL, (char*) "<IP address> [timeout(ms)]", (char*) "ping to an IP address.(This command is deprecated and it will be removed in the future. Please use wifi_ping command)"}, \
    { (char*) "get_rssi",           get_rssi,         0, NULL, NULL, (char*) "", (char*) "Get the received signal strength of the AP (client mode only).(This command is deprecated and it will be removed in the future. Please use wifi_get_rssi command)"}, \
    { (char*) "wifi_join",          join,             2, NULL, NULL, (char*) "<ssid> <open|wpa_aes|wpa_tkip|wpa2|wpa2_aes|wpa2_aes_sha256|wpa2_tkip|wpa2_fbt|wpa3|wpa3_wpa2> [password] [channel] [band<0=auto,1=5G,2=2.4G,3=6G>]"ESCAPE_SPACE_PROMPT, (char*) "Join an AP."}, \
    { (char*) "wifi_leave",         leave,            0, NULL, NULL, (char*) "", (char*) "Leave the connected AP."}, \
    { (char*) "wifi_scan",          scan,             0, NULL, NULL, (char*) "", (char*) "Scan all the Wi-FI AP in the vicinity."}, \
    { (char*) "wifi_ping",          ping,             0, NULL, NULL, (char*) "<IP address> [timeout(ms)]", (char*) "ping to an IP address"}, \
    { (char*) "wifi_get_rssi",      get_rssi,         0, NULL, NULL, (char*) "", (char*) "Get the received signal strength of the AP (client mode only)."}, \
    { (char*) "start_ap",           start_ap,         4, NULL, NULL, \
      (char*) "<ssid> <open|wpa2|wpa2_aes|wpa3|wpa3_wpa2|wep|wep_shared> <key> <channel> [band<0=auto,1=5G,2=2.4G,3=6G>] <bandwidth> [ip] [netmask]\n-->When any parameter has spaces, use quotes.\n\tE.g. start_ap \"my ssid\" wpa2 \"my wpa2 key \" 11 20 192.168.2.1 255.255.255.0.  Default settings for ip and subnet mask are 192.168.0.1 and 255.255.255.0, or the last ip and subnet specified through this command if applicable.", \
      (char*) "Start AP mode."}, \
    { (char*) "stop_ap",            stop_ap,          0, NULL, NULL, (char*) "", (char*) "Stop AP mode."}, \
    { (char*) "get_sta_ifconfig",   get_sta_ifconfig, 0, NULL, NULL, (char*) "", (char*) "Get IP & MAC address of STA."}, \
    { (char*) "ap",                 start_def_ap,     0, NULL, NULL, (char*) "", (char*) "Start AP with default parameters"}, \
    { (char*) "ap2",                start_def_ap2,    0, NULL, NULL, (char*) "", (char*) "Start AP with default parameters 2.4GHz"}, \
    { (char*) "ap5",                start_def_ap5,    0, NULL, NULL, (char*) "", (char*) "Start AP with default parameters 5GHz"}, \
    { (char*) "sta",                start_def_sta,    0, NULL, NULL, (char*) "", (char*) "Start STA with default parameters"}, \
    { (char*) "sta2",               start_def_sta2,   0, NULL, NULL, (char*) "", (char*) "Start STA with default parameters WPA2"}, \
    { (char*) "dis_pre",            disable_iovar_pre, 0, NULL, NULL, (char*) "", (char*) "Disable IOVARs pre join"}, \
    { (char*) "dis_post",           disable_iovar_post,0, NULL, NULL, (char*) "", (char*) "Disable IOVARs post join"}, \
    { (char*) "pfc",                iperf_client_def, 0, NULL, NULL, (char*) "", (char*) "Start iperf client with default parameters (iperf -c 192.168.2.2 -u -b 500pps -t 0)"}, \
    { (char*) "pfs",                iperf_server_def, 0, NULL, NULL, (char*) "", (char*) "Start iperf server with default parameters (iperf -s -u)"}, \

/******************************************************
 *                    Constants
 ******************************************************/

