StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/command-console/source/wifi_utility/COMPONENT_WCM/wifi_utility.c
static const cy_command_console_cmd_t wifi_command_table[] =
{
    WIFI_COMMANDS_LIMITED_SET
    CMD_TABLE_END
};

/******************************************************
 *                   Enumerations
 ******************************************************/

/******************************************************
 *                 Type Definitions
 ******************************************************/

/******************************************************
 *                    Structures
 ******************************************************/

/******************************************************
 *               Function Declarations
 ******************************************************/
static void scan_result_cb(cy_wcm_scan_result_t *result_ptr, void *user_data, cy_wcm_scan_status_t status);

static int convert_to_wcm_connect_params(int argc, char* argv[], cy_wcm_connect_params_t* connect_params);
static int wifi_utils_str_to_ip(char* ip_str, cy_wcm_ip_address_t* ip_addr);
static int wifi_utils_str_to_band(char* channel_str, char* band_str, cy_wcm_wifi_band_t* band);
static cy_wcm_security_t wifi_utils_str_to_authtype(char* auth_str);
static const char* wifi_utils_authtype_to_str(cy_wcm_security_t sec);

void print_ip4(uint32_t ip);
static cy_rslt_t start_ap_common(const char *ssid, const char *key, uint8_t channel, cy_wcm_security_t security_type, cy_wcm_custom_ie_info_t *custom_ie, cy_wcm_wifi_band_t band);

/******************************************************
 *               Variables Definitions
 ******************************************************/
static const cy_wcm_ip_setting_t ap_ip_settings =
{
    INITIALISER_IPV4_ADDRESS1(.ip_address, MAKE_IPV4_ADDRESS1(192, 168, 2, 1)),
    INITIALISER_IPV4_ADDRESS1(.netmask, MAKE_IPV4_ADDRESS1(255, 255, 255, 0)),
    INITIALISER_IPV4_ADDRESS1(.gateway, MAKE_IPV4_ADDRESS1(192, 168, 2, 1)),
};

/******************************************************
 *               Function Definitions
 ******************************************************/

WIFI_WEAK_FUNC cy_rslt_t wifi_utility_init(void)
{
    cy_rslt_t res;
    cy_wcm_config_t wcm_config;

    cy_command_console_add_table(wifi_command_table);

    wcm_config.interface = CY_WCM_INTERFACE_TYPE_AP_STA;
    res = cy_wcm_init(&wcm_config);
    if(res != CY_RSLT_SUCCESS)
    {
        WIFI_ERROR(("Failed to initialize Wi-Fi module. Res:0x%X\n", (unsigned int)res));
        return res;
    }
    WIFI_INFO(("Wi-Fi module initialized...\n"));

    return res;
}

int join(int argc, char* argv[], tlv_buffer_t** data)
{
    global_iface = CY_SOCKET_STA_INTERFACE;
    whd_if = whd_ifs[CY_WCM_INTERFACE_TYPE_STA];
    
    cy_rslt_t res;
    int result;
    cy_wcm_connect_params_t connect_params;
    cy_wcm_ip_address_t ip_addr;
    int retry_count = 0;
    bool wifi_connected = false;

    if(cy_wcm_is_connected_to_ap())
    {
        WIFI_INFO(("Already connected. Leave and join again.\n"));
        return 0;
    }

    result = convert_to_wcm_connect_params(argc, argv, &connect_params);
    if(result != 0)
    {
        return result;
    }

    WIFI_INFO(("Connecting to AP please wait...\n"));
    for(retry_count = 0; retry_count < CMD_CONSOLE_MAX_WIFI_RETRY_COUNT; retry_count++)
    {
        memset(&ip_addr, 0x00, sizeof(cy_wcm_ip_address_t));
        res = cy_wcm_connect_ap(&connect_params, &ip_addr);
        if(res != CY_RSLT_SUCCESS)
        {
            cy_rtos_delay_milliseconds(500); //sean_update
            WIFI_INFO(("Failed to join AP [0x%X]. Retrying...\n", (unsigned int)res));
            continue;
        }
        wifi_connected = true;
        WIFI_INFO(("Successfully connected to %s\n", argv[1]));
        print_ip4(ip_addr.ip.v4);
        break;
    }

    if(!wifi_connected)
    {
        WIFI_ERROR(("Exceeded maximum Wi-Fi connection attempts.\n"));
        return -1;
    }

    return 0;
}

int leave(int argc, char* argv[], tlv_buffer_t** data)
{
    cy_rslt_t res;

    if(!cy_wcm_is_connected_to_ap())
    {
        WIFI_INFO(("Failed to leave. Not connected to any AP.\n"));
        return 0;
    }

    res = cy_wcm_disconnect_ap();
    if(res != CY_RSLT_SUCCESS)
    {
        WIFI_ERROR(("Failed to disconnect from AP. Res:0x%X", (unsigned int)res));
        return -1;
    }

    WIFI_INFO(("Disconnected from AP.\n"));

    return 0;
}

int scan(int argc, char* argv[], tlv_buffer_t** data)
{
    cy_rslt_t res;

    WIFI_INFO(("#### Scan Results ####\n\n"));
    WIFI_INFO(("SSID                 Security Type  RSSI(dBm)  Channel BSSID\n"));

    res = cy_wcm_start_scan(scan_result_cb, NULL, NULL);
    if(res != CY_RSLT_SUCCESS && res != CY_RSLT_WCM_SCAN_IN_PROGRESS)
    {
        WIFI_ERROR(("Error while scanning. Res: 0x%X", (unsigned int)res));
        return -1;
    }

    return 0;
}

int ping(int argc, char* argv[], tlv_buffer_t** data)
{
    cy_rslt_t res;
    cy_wcm_ip_address_t ip_addr;
    uint32_t timeout_ms = CMD_CONSOLE_PING_TIMEOUT_DEFAULT;
    uint32_t elapsed_ms;

    if(!cy_wcm_is_connected_to_ap())
    {
        WIFI_INFO(("Not connected to AP.\n"));
        return 0;
    }

    if(argc < 2)
    {
        WIFI_ERROR(("Wrong number of arguments. Command format: ping <ipaddr> [timeout(ms)]\n"));
        return -1;
    }

    if(wifi_utils_str_to_ip(argv[1], &ip_addr) == -1)
    {
        return -1;
    }

    if(argc == 3)
    {
        timeout_ms = atoi(argv[2]);
    }

    res = cy_wcm_ping(CY_WCM_INTERFACE_TYPE_STA, &ip_addr, timeout_ms, &elapsed_ms);
    if(res != CY_RSLT_SUCCESS)
    {
        WIFI_ERROR(("Ping failed. Error: 0x%X\n", (unsigned int)res));
        return -1;
    }

    WIFI_INFO(("Ping successful. Elapsed time: %u (ms)\n", (unsigned int)elapsed_ms));

    return 0;
}

int get_rssi(int argc, char* argv[], tlv_buffer_t** data)
{
    cy_rslt_t res;
    cy_wcm_associated_ap_info_t ap_info;

    res = cy_wcm_get_associated_ap_info(&ap_info);
    if(res != CY_RSLT_SUCCESS)
    {
        WIFI_ERROR(("Failed to get RSSI. Res:0x%X\n", (unsigned int)res));
        return -1;
    }
    WIFI_INFO(("RSSI: %d dBm\n", ap_info.signal_strength));

