StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/command-console/source/wifi_utility/COMPONENT_WCM/wifi_utility.c
    return 0;
}

int start_ap(int argc, char* argv[], tlv_buffer_t** data)
{
    global_iface = CY_SOCKET_AP_INTERFACE;
    whd_if = whd_ifs[CY_WCM_INTERFACE_TYPE_AP];

    char *ssid = argv[1];
    cy_wcm_security_t auth_type = wifi_utils_str_to_authtype(argv[2]);
    char *security_key = argv[3];
    uint8_t channel = atoi(argv[4]);
    cy_wcm_wifi_band_t band = (cy_wcm_wifi_band_t)(atoi(argv[5]));
    cy_rslt_t res;

    res = start_ap_common(ssid, security_key, channel, auth_type, NULL, band);
    if(res != CY_RSLT_SUCCESS)
    {
        WIFI_ERROR(("Failed to start_ap_common. Res:0x%x\n", (unsigned int)res));
        return -1;
    }
    WIFI_INFO(("start_ap successful!\n"));
    return 0;
}

int start_def_ap (int argc, char* argv[], tlv_buffer_t** data)
{
    // Default AP parameters
    char* def_ap_argv[] = {
        "start_ap",        // command name
        "ApTest",        // SSID
        "wpa3",            // security type
        "12345678",        // password
        "149",             // channel
        "3",               // band (6G)
        "20",              // bandwidth
        "192.168.2.1",     // IP address
        "255.255.255.0"    // netmask
    };
    int def_ap_argc = sizeof(def_ap_argv) / sizeof(def_ap_argv[0]);

    // Call start_ap with default parameters
    return start_ap(def_ap_argc, def_ap_argv, data);
}

int start_def_ap2 (int argc, char* argv[], tlv_buffer_t** data)
{
    // Default AP parameters
    char* def_ap_argv[] = {
        "start_ap",        // command name
        "ApTest",        // SSID
        "wpa3",            // security type
        "12345678",        // password
        "10",              // channel
        "2",               // band (2.4G)
        "20",              // bandwidth
        "192.168.2.1",     // IP address
        "255.255.255.0"    // netmask
    };
    int def_ap_argc = sizeof(def_ap_argv) / sizeof(def_ap_argv[0]);

    // Call start_ap with default parameters
    return start_ap(def_ap_argc, def_ap_argv, data);
}

int start_def_ap5 (int argc, char* argv[], tlv_buffer_t** data)
{
    // Default AP parameters
    char* def_ap_argv[] = {
        "start_ap",        // command name
        "ApTest",        // SSID
        "wpa3",            // security type
        "12345678",        // password
        "48",              // channel
        "1",               // band (5G)
        "20",              // bandwidth
        "192.168.2.1",     // IP address
        "255.255.255.0"    // netmask
    };
    int def_ap_argc = sizeof(def_ap_argv) / sizeof(def_ap_argv[0]);

    // Call start_ap with default parameters
    return start_ap(def_ap_argc, def_ap_argv, data);
}

int start_def_sta (int argc, char* argv[], tlv_buffer_t** data)
{
    // Default STA parameters
    char* def_sta_argv[] = {
        "wifi_join",       // command name
        "ApTest",        // SSID
        "wpa3",            // security type
        "12345678"         // password
    };
    int def_sta_argc = sizeof(def_sta_argv) / sizeof(def_sta_argv[0]);

    // Call join (which handles wifi_join) with default parameters
    return join(def_sta_argc, def_sta_argv, data);
}

#include "whd.h"

int disable_iovar_pre (int argc, char* argv[], tlv_buffer_t** data)
{
    whd_result_t result;

    /* Power save */
    result = whd_wifi_set_ioctl_value( whd_if, WLC_SET_PM, 0 );
    printf("WLC_SET_PM = 0, result %ld 0x%08lX\n", result, result);
    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_MPC, 0 );
    printf("IOVAR_STR_MPC = 0, result %ld 0x%08lX\n", result, result);

    /* Disable Autocountry */
    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_AUTOCOUNTRY, 0 );
    printf("IOVAR_STR_AUTOCOUNTRY = 0, result %ld 0x%08lX\n", result, result);

    /* Disable GLOM */
    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_TX_GLOM, 0 );
    printf("IOVAR_STR_TX_GLOM = 0, result %ld 0x%08lX\n", result, result);

    return 0;
}

int disable_iovar_post (int argc, char* argv[], tlv_buffer_t** data)
{
    whd_result_t result;

    /* Roam scans */
    result = whd_wifi_set_iovar_value(whd_if, IOVAR_STR_ROAM_OFF, 1);
    printf("IOVAR_STR_ROAM_OFF = 1, result %ld 0x%08lX\n", result, result);
    result = whd_wifi_set_ioctl_value(whd_if, WLC_SET_ROAM_SCAN_PERIOD, 0);
    printf("WLC_SET_ROAM_SCAN_PERIOD = 0, result %ld 0x%08lX\n", result, result);
    result = whd_wifi_set_ioctl_value(whd_if, WLC_SET_SCANSUPPRESS, 1 );
    printf("WLC_SET_SCANSUPPRESS = 1, result %ld 0x%08lX\n", result, result);
    
    /* Power save */
    result = whd_wifi_set_ioctl_value( whd_if, WLC_SET_PM, 0 );
    printf("WLC_SET_PM = 0, result %ld 0x%08lX\n", result, result);
    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_MPC, 0 );
    printf("IOVAR_STR_MPC = 0, result %ld 0x%08lX\n", result, result);

    /* PFN/PNO */
    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_PNO_CLEAR,      0 );
    printf("IOVAR_STR_PNO_CLEAR = 0, result %ld 0x%08lX\n", result, result);
    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_PNO_ON,         0 );
    printf("IOVAR_STR_PNO_ON = 0, result %ld 0x%08lX\n", result, result);

    /* Disable Autocountry */
    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_AUTOCOUNTRY, 0 );
    printf("IOVAR_STR_AUTOCOUNTRY = 0, result %ld 0x%08lX\n", result, result);

    /* Disable ARP Offload */
    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_ARPOE, 0 );
    printf("IOVAR_STR_ARPOE = 0, result %ld 0x%08lX\n", result, result);

    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_SCAN_ASSOC_TIME,   20 );
    printf("IOVAR_STR_SCAN_ASSOC_TIME = 20, result %ld 0x%08lX\n", result, result);
    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_SCAN_UNASSOC_TIME, 20 );
    printf("IOVAR_STR_SCAN_UNASSOC_TIME = 20, result %ld 0x%08lX\n", result, result);
    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_SCAN_PASSIVE_TIME, 20 );
    printf("IOVAR_STR_SCAN_PASSIVE_TIME = 20, result %ld 0x%08lX\n", result, result);
    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_SCAN_HOME_TIME,    20 );
    printf("IOVAR_STR_SCAN_HOME_TIME = 20, result %ld 0x%08lX\n", result, result);
    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_SCAN_NPROBES,       1 );
    printf("IOVAR_STR_SCAN_NPROBES = 1, result %ld 0x%08lX\n", result, result);

    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_LISTEN_INTERVAL_BEACON, 1 );
    printf("IOVAR_STR_LISTEN_INTERVAL_BEACON = 1, result %ld 0x%08lX\n", result, result);
    result = whd_wifi_set_iovar_value( whd_if, IOVAR_STR_LISTEN_INTERVAL_DTIM,   1 );
    printf("IOVAR_STR_LISTEN_INTERVAL_DTIM = 1, result %ld 0x%08lX\n", result, result);

