StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/command-console/source/wifi_utility/COMPONENT_WCM/wifi_utility.c
    return 0;
}

int start_def_sta2 (int argc, char* argv[], tlv_buffer_t** data)
{
    // Default STA parameters
    char* def_sta_argv[] = {
        "wifi_join",       // command name
        "ApTest",        // SSID
        "wpa2",            // security type
        "12345678"         // password
    };
    int def_sta_argc = sizeof(def_sta_argv) / sizeof(def_sta_argv[0]);

    // Call join (which handles wifi_join) with default parameters
    return join(def_sta_argc, def_sta_argv, data);
}

int iperf_client_def(int argc, char* argv[], tlv_buffer_t** data)
{
    // Default iperf client parameters: iperf -c 192.168.2.2 -u -b 250pps -t 1200
    char* iperf_client_argv[] = {
        "iperf",           // command name
        "-c",              // client mode
        "192.168.2.2",     // server IP address
        "-u",              // UDP mode
        "-b",              // bandwidth
        "500pps",          // 250 packets per second
        "-t",              // time
        "2900"             // run for 1200 seconds
    };
    int iperf_client_argc = sizeof(iperf_client_argv) / sizeof(iperf_client_argv[0]);

    WIFI_INFO(("Starting iperf client with default parameters: iperf -c 192.168.2.2 -u -b 250pps -t 2100\n"));

    return iperf(iperf_client_argc, iperf_client_argv, data);
}

int iperf_server_def(int argc, char* argv[], tlv_buffer_t** data)
{
    // Default iperf server parameters: iperf -s -u
    char* iperf_server_argv[] = {
        "iperf",           // command name
        "-s",              // server mode
        "-u"               // UDP mode
    };
    int iperf_server_argc = sizeof(iperf_server_argv) / sizeof(iperf_server_argv[0]);

    WIFI_INFO(("Starting iperf server with default parameters: iperf -s -u\n"));

    return iperf(iperf_server_argc, iperf_server_argv, data);
}

int stop_ap(int argc, char* argv[], tlv_buffer_t** data)
{
    cy_rslt_t res;
    WIFI_INFO(("stop_ap start\n"));
    res = cy_wcm_stop_ap();
    if(res != CY_RSLT_SUCCESS)
    {
        WIFI_ERROR(("Failed to stop_ap. Res:0x%x", (unsigned int)res));
        return -1;
    }

    WIFI_INFO(("stop_ap successful!\n"));
    return 0;
}

int get_sta_ifconfig(int argc, char* argv[], tlv_buffer_t** data)
{
    cy_rslt_t res, result;
    cy_wcm_ip_address_t ip_addr;
    uint8_t mac[6] = {0};

    res = cy_wcm_get_ip_addr(CY_WCM_INTERFACE_TYPE_STA, &ip_addr);
    if (res != CY_RSLT_SUCCESS)
    {
         WIFI_INFO(("cy_wcm_get_ip_addr failed...! with error: [0x%X]\n", (unsigned int)res));
    }
    else
    {
         print_ip4(ip_addr.ip.v4);
    }
    result = cy_wcm_get_mac_addr(CY_WCM_INTERFACE_TYPE_STA, &mac);
    if (result != CY_RSLT_SUCCESS)
    {
         WIFI_INFO(("STA MAC Address failed result:0x%X\n", (unsigned int)result));
    }
    else
    {
         WIFI_INFO(("MAC Address: %02X:%02X:%02X:%02X:%02X:%02X\n", mac[0],mac[1],mac[2],mac[3],mac[4],mac[5]));
    }
    return 0;
}

static cy_rslt_t start_ap_common(const char *ssid, const char *key, uint8_t channel, cy_wcm_security_t security_type, cy_wcm_custom_ie_info_t *custom_ie, cy_wcm_wifi_band_t band)
{
    cy_rslt_t result;
    cy_wcm_ap_config_t ap_params;
    cy_wcm_ip_address_t ipv4_addr;

    memset(&ap_params, 0, sizeof(cy_wcm_ap_config_t));
    memcpy(ap_params.ap_credentials.SSID, ssid, strlen(ssid) + 1);
    memcpy(ap_params.ap_credentials.password, key, strlen(key) + 1);
    ap_params.ap_credentials.security = security_type;
    ap_params.channel = channel;
#ifdef WIFI_6G_CAPABLE 
    ap_params.band = band;
#endif
    ap_params.ip_settings.ip_address = ap_ip_settings.ip_address;
    ap_params.ip_settings.gateway = ap_ip_settings.gateway;
    ap_params.ip_settings.netmask = ap_ip_settings.netmask;
    if (custom_ie)
    {
        WIFI_INFO(("Setting custom IE\n"));
        ap_params.ie_info = custom_ie;
        WIFI_INFO(("custom_ie.subtype = %d \n", ap_params.ie_info->subtype));
        WIFI_INFO(("custom_ie.length = %d \n", ap_params.ie_info->length));
        WIFI_INFO(("custom_ie.ie_packet_mask  = %d \n", ap_params.ie_info->ie_packet_mask));
        WIFI_INFO(("custom_ie->data  = %s \n", (char *)ap_params.ie_info->data));
    }
    result = cy_wcm_start_ap(&ap_params);
    if (result != CY_RSLT_SUCCESS)
    {
        WIFI_INFO(("WCM AP start failed with error: [0x%X]\n", (unsigned int)result));
        return result;
    }
    WIFI_INFO(("WCM AP started\n"));
    result = cy_wcm_get_ip_addr(CY_WCM_INTERFACE_TYPE_AP, &ipv4_addr);
    if (result != CY_RSLT_SUCCESS)
    {
        WIFI_INFO(("cy_wcm_get_ip_addr failed...! with error: [0x%X]\n", (unsigned int)result));
        return result;
    }
    print_ip4(ap_params.ip_settings.ip_address.ip.v4);
    return CY_RSLT_SUCCESS;
}

void scan_result_cb(cy_wcm_scan_result_t *result_ptr, void *user_data, cy_wcm_scan_status_t status)
{
    if(status == CY_WCM_SCAN_INCOMPLETE)
    {
        WIFI_INFO(("%-20s %-14s %-10d %-7d %02X:%02X:%02X:%02X:%02X:%02X",
        result_ptr->SSID,
        wifi_utils_authtype_to_str(result_ptr->security),
        result_ptr->signal_strength,
        result_ptr->channel,
        result_ptr->BSSID[0],
        result_ptr->BSSID[1],
        result_ptr->BSSID[2],
        result_ptr->BSSID[3],
        result_ptr->BSSID[4],
        result_ptr->BSSID[5]));

        if(user_data != NULL)
        {
            WIFI_DEBUG((" message = %s ", (char*)user_data));
        }

#if IE_DATA_PRINTS
        int i = 0;
        WIFI_DEBUG((" ie len = %lu data: ", (unsigned long)result_ptr->ie_len));
        for(i=0; i<result_ptr->ie_len; i++)
        {
            WIFI_DEBUG(("%02x ", result_ptr->ie_ptr[i]));
        }
#endif
        WIFI_INFO(("\n"));
    }
    else if(status == CY_WCM_SCAN_COMPLETE)
    {
        WIFI_INFO(("#### Scan Results END ####\n\n"));
    }
}

int convert_to_wcm_connect_params(int argc, char* argv[], cy_wcm_connect_params_t* connect_params)
{
    memset(connect_params, 0, sizeof(cy_wcm_connect_params_t));

    // command format: join <ssid> <sec type> [key] [channel/band]
    if(argc < 3)
    {
        WIFI_ERROR(("Insufficient number of arguments. Command format: join <ssid> <sec type> [key] [channel/band]\n"));
        return -1;
    }

    if(strlen(argv[1]) >= CMD_CONSOLE_SSID_MAX_LENGTH)
    {
        WIFI_ERROR(("SSID length should be lesser than [%d] bytes.\n", CMD_CONSOLE_SSID_MAX_LENGTH));
        return -1;
    }

