StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/command-console/source/wifi_utility/COMPONENT_WCM/wifi_utility.c
    // ssid
    memcpy(connect_params->ap_credentials.SSID, argv[1], strlen(argv[1]) + 1);

    // security type
    connect_params->ap_credentials.security = wifi_utils_str_to_authtype(argv[2]);
    if(connect_params->ap_credentials.security == CY_WCM_SECURITY_UNKNOWN)
    {
        WIFI_ERROR(("Cannot connect due to unsupported auth type.\n"));
        return -1;
    }

    // passkey
    if(connect_params->ap_credentials.security != CY_WCM_SECURITY_OPEN)
    {
        if(argc < 4)
        {
            WIFI_ERROR(("Insufficient number of arguments.\n"));
            return -1;
        }
        if(strlen(argv[3]) >= CMD_CONSOLE_PASS_MAX_LENGTH)
        {
            WIFI_ERROR(("Password length should be lesser than [%d] bytes.\n", CMD_CONSOLE_PASS_MAX_LENGTH));
            return -1;
        }
        memcpy(connect_params->ap_credentials.password, argv[3], strlen(argv[3]) + 1);
    }

    // channel
    if(argc == 5 && wifi_utils_str_to_band(argv[4], NULL, &connect_params->band) == -1)
    {
        return -1;
    }

    // channel/band
    if(argc == 6 && wifi_utils_str_to_band(argv[4], argv[5], &connect_params->band) == -1)
    {
        return -1;
    }

    static cy_wcm_ip_setting_t static_ip_settings = { 0 };

    static_ip_settings.ip_address.version = CY_WCM_IP_VER_V4;
    static_ip_settings.ip_address.ip.v4   = MAKE_IPV4_ADDRESS1(192, 168, 2, 2);
    static_ip_settings.gateway.version    = CY_WCM_IP_VER_V4;
    static_ip_settings.gateway.ip.v4      = MAKE_IPV4_ADDRESS1(192, 168, 2, 1);
    static_ip_settings.netmask.version    = CY_WCM_IP_VER_V4;
    static_ip_settings.netmask.ip.v4      = MAKE_IPV4_ADDRESS1(255, 255, 255, 0);

    connect_params->static_ip_settings = &static_ip_settings;
    return 0;
}

int wifi_utils_str_to_ip(char* ip_str, cy_wcm_ip_address_t* ip_addr)
{
    int bytes[CMD_CONSOLE_IPV4_ADDR_SIZE];
    char* p = NULL;
    char* rest = NULL;
    int i = 0;
    char* delimiter = ".";

    if((ip_str == NULL)||(ip_addr == NULL))
    {
        WIFI_ERROR(("Invalid parameter.\n"));
        return -1;
    }
    memset(&bytes, 0x00, sizeof(bytes));
    rest = ip_str;
    p = strtok_r (rest, delimiter, &rest);
    if(p == NULL)
    {
        WIFI_ERROR(("Invalid IP Addr.\n"));
        return -1;
    }
    bytes[i] = atoi(p);
    WIFI_DEBUG(("bytes[%d]:%d\n", i, bytes[i]));
    while(p != NULL)
    {
        ++i;
        p = strtok_r (rest, delimiter, &rest);
        if(i < CMD_CONSOLE_IPV4_ADDR_SIZE)
        {
            if(p == NULL)
            {
                WIFI_ERROR(("Invalid IP Addr.\n"));
                return -1;
            }
            bytes[i] = atoi(p);
            WIFI_DEBUG(("bytes[%d]:%d\n", i, bytes[i]));
        }
    }

    if(i != (CMD_CONSOLE_IPV4_ADDR_SIZE))
    {
        WIFI_ERROR(("Invalid IP Addr.\n"));
        return -1;
    }

    ip_addr->version = CY_WCM_IP_VER_V4;
    ip_addr->ip.v4 = (uint32_t)MAKE_IPV4_ADDRESS1(bytes[0], bytes[1], bytes[2], bytes[3]);

    return 0;
}

int wifi_utils_str_to_band(char* channel_str, char* band_str, cy_wcm_wifi_band_t* band)
{
    int channel = atoi(channel_str);
    int band_arg = CY_WCM_WIFI_BAND_ANY;

    if (band_str != NULL)
    {
        band_arg = atoi(band_str);
    }

    if((band_arg == CY_WCM_WIFI_BAND_ANY || band_arg == CY_WCM_WIFI_BAND_2_4GHZ) &&
        (channel >= 1 && channel <= 14))
    {
        *band = CY_WCM_WIFI_BAND_2_4GHZ;
    }
    else if((band_arg == CY_WCM_WIFI_BAND_ANY || band_arg == CY_WCM_WIFI_BAND_5GHZ) &&
        (channel >= 32 && channel <= 165))
    {
        *band = CY_WCM_WIFI_BAND_5GHZ;
    }
#if defined(WIFI_6G_CAPABLE)
    else if((band_arg == CY_WCM_WIFI_BAND_ANY || band_arg == CY_WCM_WIFI_BAND_6GHZ) &&
        (channel >= 1 && channel <= 233))
    {
        *band = CY_WCM_WIFI_BAND_6GHZ;
    }
#endif // defined(WIFI_6G_CAPABLE)
    else
    {
        WIFI_ERROR(("Invalid channel(%d) band(%d). Valid values: 1 to 14 - 2.4GHz, 32 to 165 - 5GHz, 1 to 233 - 6GHz(Please define WIFI_6G_CAPABLE in Makefile)\n",
            channel, band_arg));
        return -1;
    }

    return 0;
}

cy_wcm_security_t wifi_utils_str_to_authtype(char* auth_str)
{
    if (strcmp(auth_str, "open") == 0)
    {
        return CY_WCM_SECURITY_OPEN;
    }
    else if(strcmp(auth_str, "wpa2_tkip") == 0)
    {
        return CY_WCM_SECURITY_WPA2_TKIP_PSK;
    }
    else if(strcmp(auth_str, "wpa2_aes") == 0)
    {
        return CY_WCM_SECURITY_WPA2_AES_PSK;
    }
    else if(strcmp(auth_str, "wpa2_aes_sha256") == 0)
    {
        return CY_WCM_SECURITY_WPA2_AES_PSK_SHA256;
    }
    else if(strcmp(auth_str, "wpa2") == 0)
    {
        return CY_WCM_SECURITY_WPA2_MIXED_PSK;
    }
    else if(strcmp(auth_str, "wpa_aes" ) == 0)
    {
        return CY_WCM_SECURITY_WPA_AES_PSK;
    }
    else if (strcmp(auth_str, "wpa_tkip") == 0)
    {
        return CY_WCM_SECURITY_WPA_TKIP_PSK;
    }
    else if(strcmp(auth_str, "wpa3") == 0)
    {
        return CY_WCM_SECURITY_WPA3_SAE;
    }
    else if(strcmp(auth_str, "wpa3_wpa2") == 0)
    {
        return CY_WCM_SECURITY_WPA3_WPA2_PSK;
    }
    else
    {
        WIFI_ERROR(("Unsupported auth type: '%s'\r\n", auth_str));
        return CY_WCM_SECURITY_UNKNOWN;
    }
}

const char* wifi_utils_authtype_to_str(cy_wcm_security_t sec)
{
    switch (sec)
    {
        case CY_WCM_SECURITY_OPEN:
            return "open";
        case CY_WCM_SECURITY_WEP_PSK:
        case CY_WCM_SECURITY_WEP_SHARED:
            return "wep";
        case CY_WCM_SECURITY_WPA2_MIXED_PSK:
            return "wpa2";
        case CY_WCM_SECURITY_WPA_AES_PSK:
            return "wpa_aes";
        case CY_WCM_SECURITY_WPA2_AES_PSK_SHA256:
            return "wpa2_aes_sha256";
        case CY_WCM_SECURITY_WPA2_AES_PSK:
            return "wpa2_aes";
        case CY_WCM_SECURITY_WPA_TKIP_PSK:
            return "wpa_tkip";
        case CY_WCM_SECURITY_WPA2_TKIP_PSK:
            return "wpa2_tkip";
        case CY_WCM_SECURITY_WPA3_SAE:
            return "wpa3";
        case CY_WCM_SECURITY_WPA3_WPA2_PSK:
            return "wpa3_wpa2";
        case CY_WCM_SECURITY_WPA_AES_ENT:
            return "wpa_aes_ent";
        case CY_WCM_SECURITY_WPA_MIXED_ENT:
            return "wpa_mixed_ent";
        case CY_WCM_SECURITY_WPA2_TKIP_ENT:
            return "wpa2_tkip_ent";
        case CY_WCM_SECURITY_WPA2_AES_ENT:
            return "wpa2_aes_ent";
        case CY_WCM_SECURITY_WPA2_MIXED_ENT:
            return "wpa2_mixed_ent";
        case CY_WCM_SECURITY_WPA2_FBT_ENT:
            return "wpa2_fbt_ent";
#ifdef ENABLE_ENTPS_FEATURE
        case CY_WCM_SECURITY_WPA3_192BIT_ENT:
            return "wpa3_192bit_ent";
        case CY_WCM_SECURITY_WPA3_ENT:
            return "wpa3_aes_gcm_256_ent";
        case CY_WCM_SECURITY_WPA3_ENT_AES_CCMP:
            return "wpa3_aes_ccm_128_ent";
#endif
        case CY_WCM_SECURITY_UNKNOWN:
            return "Unknown";
        default:
            return "Unsupported";
    }
}

void print_ip4(uint32_t ip)
{
    unsigned char bytes[CMD_CONSOLE_IPV4_ADDR_SIZE];
    bytes[0] = ip & 0xFF;
    bytes[1] = (ip >> 8) & 0xFF;
    bytes[2] = (ip >> 16) & 0xFF;
    bytes[3] = (ip >> 24) & 0xFF;

    WIFI_INFO(("IP Address: %d.%d.%d.%d\n", bytes[0], bytes[1], bytes[2], bytes[3]));
}

#ifdef __cplusplus
}
#endif
#endif
